OKMCU/free-serial-bootloader/bsp/GD32E232x8/Firmware/GD32E232_standard_peripheral/Include/gd32e232_cla.h
/*!
    \file  gd32e232_cla.h
    \brief definitions for the CLA
    
    \version 2019-05-15, V1.0.0, firmware for GD32E232
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32E232_CLA_H
#define GD32E232_CLA_H

#include "gd32e232.h"

/*CLA definitions */
#define CLA                                CLA_BASE

/* registers definitions */
#define CLA_GCTL                           REG32((CLA) + 0x00000000U)                  /*!< CLA global control register */
#define CLA_INTE                           REG32((CLA) + 0x00000004U)                  /*!< CLA interrupt flag enable register */
#define CLA_INTF                           REG32((CLA) + 0x00000008U)                  /*!< CLA interrupt flag register */
#define CLA_STAT                           REG32((CLA) + 0x0000000CU)                  /*!< CLA status register */
#define CLA0_MUXS                          REG32((CLA) + 0x00000010U)                  /*!< CLA0 multiplexer selection register */
#define CLA1_MUXS                          REG32((CLA) + 0x0000001CU)                  /*!< CLA1 multiplexer selection register */
#define CLA2_MUXS                          REG32((CLA) + 0x00000028U)                  /*!< CLA2 multiplexer selection register */
#define CLA3_MUXS                          REG32((CLA) + 0x00000034U)                  /*!< CLA3 multiplexer selection register */
#define CLA0_LUTCTL                        REG32((CLA) + 0x00000014U)                  /*!< CLA0 LUT control register */
#define CLA1_LUTCTL                        REG32((CLA) + 0x00000020U)                  /*!< CLA1 LUT control register */
#define CLA2_LUTCTL                        REG32((CLA) + 0x0000002CU)                  /*!< CLA2 LUT control register */
#define CLA3_LUTCTL                        REG32((CLA) + 0x00000038U)                  /*!< CLA3 LUT control register */
#define CLA0_CTL                           REG32((CLA) + 0x00000018U)                  /*!< CLA0 control registor */
#define CLA1_CTL                           REG32((CLA) + 0x00000024U)                  /*!< CLA1 control register */
#define CLA2_CTL                           REG32((CLA) + 0x00000030U)                  /*!< CLA2 control register */
#define CLA3_CTL                           REG32((CLA) + 0x0000003CU)                  /*!< CLA3 control register */

#define CLA_MUXS(CLAx)                     REG32((CLA) + 0x10U + ((CLAx) * 0x0CU))     /*!< CLA multiplexer selection register */
#define CLA_LUTCTL(CLAx)                   REG32((CLA) + 0x14U + ((CLAx) * 0x0CU))     /*!< CLA LUT control register */
#define CLA_CTL(CLAx)                      REG32((CLA) + 0x18U + ((CLAx) * 0x0CU))     /*!< CLA control register */

/* bits definitions */
/* CLA_GCTL */
#define CLA_GCTL_CLA0EN                    BIT(0)                           /*!< CLA0 unit enable */
#define CLA_GCTL_CLA1EN                    BIT(1)                           /*!< CLA1 unit enable */
#define CLA_GCTL_CLA2EN                    BIT(2)                           /*!< CLA2 unit enable */
#define CLA_GCTL_CLA3EN                    BIT(3)                           /*!< CLA3 unit enable */

/* CLA_INTE */
#define CLA_INTE_CLAONIE                   BIT(0)                           /*!< CLA0 uint negedge interrupt enable */
#define CLA_INTE_CLAOPIE                   BIT(1)                           /*!< CLA0 uint posedge interrupt enable */
#define CLA_INTE_CLA1NIE                   BIT(2)                           /*!< CLA1 uint negedge interrupt enable */
#define CLA_INTE_CLA1PIE                   BIT(3)                           /*!< CLA1 uint posedge interrupt enable */
#define CLA_INTE_CLA2NIE                   BIT(4)                           /*!< CLA2 uint negedge interrupt enable */
#define CLA_INTE_CLA2PIE                   BIT(5)                           /*!< CLA2 uint posedge interrupt enable */
#define CLA_INTE_CLA3NIE                   BIT(6)                           /*!< CLA3 uint negedge interrupt enable */
#define CLA_INTE_CLA3PIE                   BIT(7)                           /*!< CLA3 uint posedge interrupt enable */

/* CLA_INTF */
#define CLA_INTF_CLA0NF                    BIT(0)                           /*!< CLA0 uint negedge flag */
#define CLA_INTF_CLA0PF                    BIT(1)                           /*!< CLA0 uint posedge flag */
#define CLA_INTF_CLA1NF                    BIT(2)                           /*!< CLA1 uint negedge flag */
#define CLA_INTF_CLA1PF                    BIT(3)                           /*!< CLA1 uint posedge flag */
#define CLA_INTF_CLA2NF                    BIT(4)                           /*!< CLA2 uint negedge flag */
#define CLA_INTF_CLA2PF                    BIT(5)                           /*!< CLA2 uint posedge flag */
#define CLA_INTF_CLA3NF                    BIT(6)                           /*!< CLA3 uint negedge flag */
#define CLA_INTF_CLA3PF                    BIT(7)                           /*!< CLA3 uint posedge flag */

/* CLA_STAT */
#define CLA_STAT_CLA0OUT                   BIT(0)                           /*!< CLA0 unit output state */
#define CLA_STAT_CLA1OUT                   BIT(1)                           /*!< CLA1 unit output state */
#define CLA_STAT_CLA2OUT                   BIT(2)                           /*!< CLA2 unit output state */
#define CLA_STAT_CLA3OUT                   BIT(3)                           /*!< CLA3 unit output state */

/* CLAx_MUXS */
#define CLA_MUXS_MUX1                      BITS(0,3)                        /*!< multiplexer 1 input selection */
#define CLA_MUXS_MUX0                      BITS(4,7)                        /*!< multiplexer 0 input selection */

/* CLAx_LUTCTL */
#define CLA_LUT                            BITS(0,7)                        /*!< LUT control */

