OKMCU/free-serial-bootloader/bsp/GD32E232x8/Firmware/GD32E232_standard_peripheral/Include/gd32e232_cla.h
/* CLAx_CTL */
#define CLA_CTL_CSEL                       BITS(0,1)                        /*!< clock selection */
#define CLA_CTL_CPOL                       BIT(2)                           /*!< clock polarity*/
#define CLA_CTL_FFRST                      BIT(3)                           /*!< Flip- flop output reset */
#define CLA_CTL_OEN                        BIT(6)                           /*!< output enable */
#define CLA_CTL_OSEL                       BIT(7)                           /*!< output selection */

/* constants definitions */
/* CLA flags */
typedef enum
{
    /* flags in INTF register */
    CLA_FLAG_CLA0NF,                                                        /*!< CLA0 unit negedge flag */
    CLA_FLAG_CLA0PF,                                                        /*!< CLA0 unit posedge flag */
    CLA_FLAG_CLA1NF,                                                        /*!< CLA1 unit negedge flag */
    CLA_FLAG_CLA1PF,                                                        /*!< CLA1 unit posedge flag */
    CLA_FLAG_CLA2NF,                                                        /*!< CLA2 unit negedge flag */
    CLA_FLAG_CLA2PF,                                                        /*!< CLA2 unit posedge flag */
    CLA_FLAG_CLA3NF,                                                        /*!< CLA3 unit negedge flag */
    CLA_FLAG_CLA3PF                                                         /*!< CLA3 unit posedge flag */
}cla_flag_enum;

/* CLA interrupt flags */
typedef enum
{
    /* interrupt flags in INTF register */
    CLA_INT_FLAG_CLA0NF,                                                    /*!< CLA0 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA0PF,                                                    /*!< CLA0 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA1NF,                                                    /*!< CLA1 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA1PF,                                                    /*!< CLA1 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA2NF,                                                    /*!< CLA2 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA2PF,                                                    /*!< CLA2 unit posedge interrupt flag */
    CLA_INT_FLAG_CLA3NF,                                                    /*!< CLA3 unit negedge interrupt flag */
    CLA_INT_FLAG_CLA3PF                                                     /*!< CLA3 unit posedge interrupt flag */
}cla_interrupt_flag_enum;

/* CLA units */
typedef enum
{
    CLA0,
    CLA1,
    CLA2,
    CLA3
}cla_enum;

/* CLA multiplexer */
typedef enum
{
    MUX0,
    MUX1
}cla_mux_enum;

/* output state of CLAx unit */
typedef enum
{
    CLA_OUTPUT_LOW,
    CLA_OUTPUT_HIGH
}cla_outputstatus_enum;

/* negedge interrupt enable */
#define CLA0NIE                          CLA_INTE_CLAONIE                   /*!< enable CLA0 unit negedge interrupt */
#define CLA1NIE                          CLA_INTE_CLA1NIE                   /*!< enable CLA1 unit negedge interrupt */
#define CLA2NIE                          CLA_INTE_CLA2NIE                   /*!< enable CLA2 unit negedge interrupt */
#define CLA3NIE                          CLA_INTE_CLA3NIE                   /*!< enable CLA3 unit negedge interrupt */

/* negedge interrupt disable */
#define CLA0NI_DISABLE                   CLA_INTE_CLAONIE                   /*!< disable CLA0 unit negedge interrupt */
#define CLA1NI_DISABLE                   CLA_INTE_CLA1NIE                   /*!< disable CLA1 unit negedge interrupt */
#define CLA2NI_DISABLE                   CLA_INTE_CLA2NIE                   /*!< disable CLA2 unit negedge interrupt */
#define CLA3NI_DISABLE                   CLA_INTE_CLA3NIE                   /*!< disable CLA3 unit negedge interrupt */

/* posedge interrupt enable */
#define CLA0PIE                          CLA_INTE_CLAOPIE                   /*!< enable CLA0 unit  posedge interrupt */
#define CLA1PIE                          CLA_INTE_CLA1PIE                   /*!< enable CLA1 unit  posedge interrupt */
#define CLA2PIE                          CLA_INTE_CLA2PIE                   /*!< enable CLA2 unit  posedge interrupt */
#define CLA3PIE                          CLA_INTE_CLA3PIE                   /*!< enable CLA3 unit  posedge interrupt */

/* posedge interrupt disable */
#define CLA0PI_DISABLE                   CLA_INTE_CLAOPIE                   /*!< disable CLA0 unit  posedge interrupt */
#define CLA1PI_DISABLE                   CLA_INTE_CLA1PIE                   /*!< disable CLA1 unit  posedge interrupt */
#define CLA2PI_DISABLE                   CLA_INTE_CLA2PIE                   /*!< disable CLA2 unit  posedge interrupt */
#define CLA3PI_DISABLE                   CLA_INTE_CLA3PIE                   /*!< disable CLA3 unit  posedge interrupt */

/* multiplexer 0 input selection */
#define CLA_MUX0(regval)                 (BITS(4,7) & ((uint32_t)(regval) << 4))
#define CLA0MUX0_CLA0_ASYNC_OUT          CLA_MUX0(0)                        /*!< the input of CLA0MUX0 is CLA0_ASYNC_OUT */
#define CLA1MUX0_CLA0_ASYNC_OUT          CLA_MUX0(0)                        /*!< the input of CLA1MUX0 is CLA0_ASYNC_OUT */
#define CLA2MUX0_CLA0_ASYNC_OUT          CLA_MUX0(0)                        /*!< the input of CLA2MUX0 is CLA0_ASYNC_OUT */
#define CLA3MUX0_CLA0_ASYNC_OUT          CLA_MUX0(0)                        /*!< the input of CLA3MUX0 is CLA0_ASYNC_OUT */

#define CLA0MUX0_CLA1_ASYNC_OUT          CLA_MUX0(1)                        /*!< the input of CLA0MUX0 is CLA1_ASYNC_OUT */
#define CLA1MUX0_CLA1_ASYNC_OUT          CLA_MUX0(1)                        /*!< the input of CLA1MUX0 is CLA1_ASYNC_OUT */
#define CLA2MUX0_CLA1_ASYNC_OUT          CLA_MUX0(1)                        /*!< the input of CLA2MUX0 is CLA1_ASYNC_OUT */
#define CLA3MUX0_CLA1_ASYNC_OUT          CLA_MUX0(1)                        /*!< the input of CLA3MUX0 is CLA1_ASYNC_OUT */

#define CLA0MUX0_CLA2_ASYNC_OUT          CLA_MUX0(2)                        /*!< the input of CLA0MUX0 is CLA2_ASYNC_OUT */
#define CLA1MUX0_CLA2_ASYNC_OUT          CLA_MUX0(2)                        /*!< the input of CLA1MUX0 is CLA2_ASYNC_OUT */
#define CLA2MUX0_CLA2_ASYNC_OUT          CLA_MUX0(2)                        /*!< the input of CLA2MUX0 is CLA2_ASYNC_OUT */
#define CLA3MUX0_CLA2_ASYNC_OUT          CLA_MUX0(2)                        /*!< the input of CLA3MUX0 is CLA2_ASYNC_OUT */

#define CLA0MUX0_CLA3_ASYNC_OUT          CLA_MUX0(3)                        /*!< the input of CLA0MUX0 is CLA3_ASYNC_OUT */
#define CLA1MUX0_CLA3_ASYNC_OUT          CLA_MUX0(3)                        /*!< the input of CLA1MUX0 is CLA3_ASYNC_OUT */
#define CLA2MUX0_CLA3_ASYNC_OUT          CLA_MUX0(3)                        /*!< the input of CLA2MUX0 is CLA3_ASYNC_OUT */
#define CLA3MUX0_CLA3_ASYNC_OUT          CLA_MUX0(3)                        /*!< the input of CLA3MUX0 is CLA3_ASYNC_OUT */

