OKMCU/free-serial-bootloader/bsp/GD32E232x8/Firmware/GD32E232_standard_peripheral/Include/gd32e232_cla.h
#define CLA0MUX0_TIMER1_TRGO             CLA_MUX0(4)                        /*!< the input of CLA0MUX0 is TIMER1_TRGO */
#define CLA1MUX0_TIMER2_TRGO             CLA_MUX0(4)                        /*!< the input of CLA1MUX0 is TIMER2_TRGO */
#define CLA2MUX0_TIMER5_TRGO             CLA_MUX0(4)                        /*!< the input of CLA2MUX0 is TIMER5_TRGO */
#define CLA3MUX0_TIMER6_TRGO             CLA_MUX0(4)                        /*!< the input of CLA3MUX0 is TIMER6_TRGO */

#define CLA0MUX0_TIMER0_CH0              CLA_MUX0(5)                        /*!< the input of CLA0MUX0 is TIMER0_CH0 */
#define CLA1MUX0_TIMER0_CH0              CLA_MUX0(5)                        /*!< the input of CLA1MUX0 is TIMER0_CH0 */
#define CLA2MUX0_TIMER0_CH1              CLA_MUX0(5)                        /*!< the input of CLA2MUX0 is TIMER0_CH1 */
#define CLA3MUX0_TIMER0_CH2              CLA_MUX0(5)                        /*!< the input of CLA3MUX0 is TIMER0_CH2 */

#define CLA0MUX0_TIMER0_CH1              CLA_MUX0(6)                        /*!< the input of CLA0MUX0 is TIMER0_CH2 */
#define CLA1MUX0_TIMER0_CH3              CLA_MUX0(6)                        /*!< the input of CLA0MUX0 is TIMER0_CH2 */
#define CLA2MUX0_TIMER0_CH3              CLA_MUX0(6)                        /*!< the input of CLA0MUX0 is TIMER0_CH2 */
#define CLA3MUX0_TIMER1_CH0              CLA_MUX0(6)                        /*!< the input of CLA0MUX0 is TIMER0_CH2 */

#define CLA0MUX0_TIMER0_CH2              CLA_MUX0(7)                        /*!< the input of CLA0MUX0 is TIMER0_CH2 */
#define CLA1MUX0_TIMER1_CH0              CLA_MUX0(7)                        /*!< the input of CLA1MUX0 is TIMER1_CH0 */
#define CLA2MUX0_TIMER1_CH1              CLA_MUX0(7)                        /*!< the input of CLA2MUX0 is TIMER1_CH1 */
#define CLA3MUX0_TIMER1_CH1              CLA_MUX0(7)                        /*!< the input of CLA3MUX0 is TIMER1_CH1 */

#define CLA0MUX0_CLAIN0                  CLA_MUX0(8)                        /*!< the input of CLA0MUX0 is CLAIN0(PA15) */
#define CLA1MUX0_CLAIN4                  CLA_MUX0(8)                        /*!< the input of CLA1MUX0 is CLAIN4(PB6) */
#define CLA2MUX0_CLAIN0                  CLA_MUX0(8)                        /*!< the input of CLA2MUX0 is CLAIN0(PA15) */
#define CLA3MUX0_CLAIN2                  CLA_MUX0(8)                        /*!< the input of CLA3MUX0 is CLAIN2(PB4) */

#define CLA0MUX0_CLAIN2                  CLA_MUX0(9)                        /*!< the input of CLA0MUX0 is CLAIN2(PB4) */
#define CLA1MUX0_CLAIN5                  CLA_MUX0(9)                        /*!< the input of CLA1MUX0 is CLAIN5(PB7) */
#define CLA2MUX0_CLAIN1                  CLA_MUX0(9)                        /*!< the input of CLA2MUX0 is CLAIN1(PB3) */
#define CLA3MUX0_CLAIN3                  CLA_MUX0(9)                        /*!< the input of CLA3MUX0 is CLAIN3(PB5) */

#define CLA0MUX0_CLAIN4                  CLA_MUX0(10)                       /*!< the input of CLA0MUX0 is CLAIN4(PB6) */
#define CLA1MUX0_CLAIN8                  CLA_MUX0(10)                       /*!< the input of CLA1MUX0 is CLAIN8(PB0) */
#define CLA2MUX0_CLAIN8                  CLA_MUX0(10)                       /*!< the input of CLA2MUX0 is CLAIN8(PB0) */
#define CLA3MUX0_CLAIN6                  CLA_MUX0(10)                       /*!< the input of CLA3MUX0 is CLAIN6(PB8) */

#define CLA0MUX0_CLAIN6                  CLA_MUX0(11)                       /*!< the input of CLA0MUX0 is CLAIN6(PB8) */
#define CLA1MUX0_CLAIN10                 CLA_MUX0(11)                       /*!< the input of CLA1MUX0 is CLAIN10(PB2) */
#define CLA2MUX0_CLAIN9                  CLA_MUX0(11)                       /*!< the input of CLA2MUX0 is CLAIN9(PB1) */
#define CLA3MUX0_CLAIN7                  CLA_MUX0(11)                       /*!< the input of CLA3MUX0 is CLAIN7(PB9) */

#define CLA0MUX0_CLAIN8                  CLA_MUX0(12)                       /*!< the input of CLA0MUX0 is CLAIN8(PB0) */
#define CLA1MUX0_CLAIN12                 CLA_MUX0(12)                       /*!< the input of CLA1MUX0 is CLAIN12(PA9) */
#define CLA2MUX0_CLAIN14                 CLA_MUX0(12)                       /*!< the input of CLA2MUX0 is CLAIN14(PA11) */
#define CLA3MUX0_CLAIN10                 CLA_MUX0(12)                       /*!< the input of CLA3MUX0 is CLAIN10(PB2) */

#define CLA0MUX0_CLAIN10                 CLA_MUX0(13)                       /*!< the input of CLA0MUX0 is CLAIN10(PB2) */
#define CLA1MUX0_CLAIN13                 CLA_MUX0(13)                       /*!< the input of CLA1MUX0 is CLAIN13(PA10) */
#define CLA2MUX0_CLAIN15                 CLA_MUX0(13)                       /*!< the input of CLA2MUX0 is CLAIN15(PA12) */
#define CLA3MUX0_CLAIN11                 CLA_MUX0(13)                       /*!< the input of CLA3MUX0 is CLAIN11(PA8) */

#define CLA0MUX0_CLAIN12                 CLA_MUX0(14)                       /*!< the input of CLA0MUX0 is CLAIN12(PA9) */
#define CLA1MUX0_CLAIN16                 CLA_MUX0(14)                       /*!< the input of CLA1MUX0 is CLAIN16(PF0) */
#define CLA2MUX0_CLAIN16                 CLA_MUX0(14)                       /*!< the input of CLA2MUX0 is CLAIN16(PF0) */
#define CLA3MUX0_CLAIN18                 CLA_MUX0(14)                       /*!< the input of CLA3MUX0 is CLAIN18(PA0) */

#define CLA0MUX0_CLAIN14                 CLA_MUX0(15)                       /*!< the input of CLA0MUX0 is CLAIN14(PA11) */
#define CLA1MUX0_CLAIN18                 CLA_MUX0(15)                       /*!< the input of CLA1MUX0 is CLAIN18(PA0) */
#define CLA2MUX0_CLAIN17                 CLA_MUX0(15)                       /*!< the input of CLA2MUX0 is CLAIN17(PF1) */
#define CLA3MUX0_CLAIN19                 CLA_MUX0(15)                       /*!< the input of CLA3MUX0 is CLAIN19(PA1) */

/* multiplexer 1 input selection */
#define CLA_MUX1(regval)                 (BITS(0,3) & ((uint32_t)(regval) << 0))
#define CLA0MUX1_CLA0_ASYNC_OUT          CLA_MUX1(0)                        /*!< the input of CLA0MUX1 is CLA0_ASYNC_OUT */
#define CLA1MUX1_CLA0_ASYNC_OUT          CLA_MUX1(0)                        /*!< the input of CLA1MUX1 is CLA0_ASYNC_OUT */
#define CLA2MUX1_CLA0_ASYNC_OUT          CLA_MUX1(0)                        /*!< the input of CLA2MUX1 is CLA0_ASYNC_OUT */
#define CLA3MUX1_CLA0_ASYNC_OUT          CLA_MUX1(0)                        /*!< the input of CLA3MUX1 is CLA0_ASYNC_OUT */

#define CLA0MUX1_CLA1_ASYNC_OUT          CLA_MUX1(1)                        /*!< the input of CLA0MUX1 is CLA1_ASYNC_OUT */
#define CLA1MUX1_CLA1_ASYNC_OUT          CLA_MUX1(1)                        /*!< the input of CLA1MUX1 is CLA1_ASYNC_OUT */
#define CLA2MUX1_CLA1_ASYNC_OUT          CLA_MUX1(1)                        /*!< the input of CLA2MUX1 is CLA1_ASYNC_OUT */
#define CLA3MUX1_CLA1_ASYNC_OUT          CLA_MUX1(1)                        /*!< the input of CLA3MUX1 is CLA1_ASYNC_OUT */

#define CLA0MUX1_CLA2_ASYNC_OUT          CLA_MUX1(2)                        /*!< the input of CLA0MUX1 is CLA2_ASYNC_OUT */
#define CLA1MUX1_CLA2_ASYNC_OUT          CLA_MUX1(2)                        /*!< the input of CLA1MUX1 is CLA2_ASYNC_OUT */
#define CLA2MUX1_CLA2_ASYNC_OUT          CLA_MUX1(2)                        /*!< the input of CLA2MUX1 is CLA2_ASYNC_OUT */
#define CLA3MUX1_CLA2_ASYNC_OUT          CLA_MUX1(2)                        /*!< the input of CLA3MUX1 is CLA2_ASYNC_OUT */

