OKMCU/free-serial-bootloader/bsp/GD32E232x8/Firmware/GD32E232_standard_peripheral/Include/gd32e232_cla.h
#define CLA0MUX1_CLA3_ASYNC_OUT          CLA_MUX1(3)                        /*!< the input of CLA0MUX1 is CLA3_ASYNC_OUT */
#define CLA1MUX1_CLA3_ASYNC_OUT          CLA_MUX1(3)                        /*!< the input of CLA1MUX1 is CLA3_ASYNC_OUT */
#define CLA2MUX1_CLA3_ASYNC_OUT          CLA_MUX1(3)                        /*!< the input of CLA2MUX1 is CLA3_ASYNC_OUT */
#define CLA3MUX1_CLA3_ASYNC_OUT          CLA_MUX1(3)                        /*!< the input of CLA3MUX1 is CLA3_ASYNC_OUT */

#define CLA0MUX1_ADC_CONV                CLA_MUX1(4)                        /*!< the input of CLA0MUX1 is ADC_CONV */
#define CLA1MUX1_ADC_CONV                CLA_MUX1(4)                        /*!< the input of CLA1MUX1 is ADC_CONV */
#define CLA2MUX1_ADC_CONV                CLA_MUX1(4)                        /*!< the input of CLA2MUX1 is ADC_CONV */
#define CLA3MUX1_ADC_CONV                CLA_MUX1(4)                        /*!< the input of CLA3MUX1 is ADC_CONV */

#define CLA0MUX1_TIMER0_CH3              CLA_MUX1(5)                        /*!< the input of CLA0MUX1 is TIMER0_CH3 */
#define CLA1MUX1_TIMER0_CH1              CLA_MUX1(5)                        /*!< the input of CLA1MUX1 is TIMER0_CH1 */
#define CLA2MUX1_TIMER0_CH0              CLA_MUX1(5)                        /*!< the input of CLA2MUX1 is TIMER0_CH0 */
#define CLA3MUX1_TIMER0_CH0              CLA_MUX1(5)                        /*!< the input of CLA3MUX1 is TIMER0_CH0 */

#define CLA0MUX1_TIMER1_CH0              CLA_MUX1(6)                        /*!< the input of CLA0MUX1 is TIMER1_CH0 */
#define CLA1MUX1_TIMER0_CH2              CLA_MUX1(6)                        /*!< the input of CLA1MUX1 is TIMER0_CH2 */
#define CLA2MUX1_TIMER0_CH2              CLA_MUX1(6)                        /*!< the input of CLA2MUX1 is TIMER0_CH2 */
#define CLA3MUX1_TIMER0_CH1              CLA_MUX1(6)                        /*!< the input of CLA3MUX1 is TIMER0_CH1 */

#define CLA0MUX1_TIMER2_CH1              CLA_MUX1(7)                        /*!< the input of CLA0MUX1 is TIMER2_CH1 */
#define CLA1MUX1_TIMER2_CH1              CLA_MUX1(7)                        /*!< the input of CLA1MUX1 is TIMER2_CH1 */
#define CLA2MUX1_TIMER1_CH0              CLA_MUX1(7)                        /*!< the input of CLA2MUX1 is TIMER1_CH0 */
#define CLA3MUX1_TIMER0_CH3              CLA_MUX1(7)                        /*!< the input of CLA3MUX1 is TIMER0_CH3 */

#define CLA0MUX1_CLAIN1                  CLA_MUX1(8)                        /*!< the input of CLA0MUX1 is CLAIN1(PB3) */
#define CLA1MUX1_CLAIN6                  CLA_MUX1(8)                        /*!< the input of CLA1MUX1 is CLAIN6(PB8) */
#define CLA2MUX1_CLAIN2                  CLA_MUX1(8)                        /*!< the input of CLA2MUX1 is CLAIN2(PB4) */
#define CLA3MUX1_CLAIN0                  CLA_MUX1(8)                        /*!< the input of CLA3MUX1 is CLAIN0(PA15) */

#define CLA0MUX1_CLAIN3                  CLA_MUX1(9)                        /*!< the input of CLA0MUX1 is CLAIN3(PB5) */
#define CLA1MUX1_CLAIN7                  CLA_MUX1(9)                        /*!< the input of CLA1MUX1 is CLAIN7(PB9) */
#define CLA2MUX1_CLAIN3                  CLA_MUX1(9)                        /*!< the input of CLA2MUX1 is CLAIN3(PB5) */
#define CLA3MUX1_CLAIN1                  CLA_MUX1(9)                        /*!< the input of CLA3MUX1 is CLAIN1(PB3) */

#define CLA0MUX1_CLAIN5                  CLA_MUX1(10)                       /*!< the input of CLA0MUX1 is CLAIN5(PB7) */
#define CLA1MUX1_CLAIN9                  CLA_MUX1(10)                       /*!< the input of CLA1MUX1 is CLAIN9(PB1) */
#define CLA2MUX1_CLAIN10                 CLA_MUX1(10)                       /*!< the input of CLA2MUX1 is CLAIN10(PB2) */
#define CLA3MUX1_CLAIN4                  CLA_MUX1(10)                       /*!< the input of CLA3MUX1 is CLAIN4(PB6) */

#define CLA0MUX1_CLAIN6                  CLA_MUX1(11)                       /*!< the input of CLA0MUX1 is CLAIN6(PB8) */
#define CLA1MUX1_CLAIN11                 CLA_MUX1(11)                       /*!< the input of CLA1MUX1 is CLAIN11(PA8) */
#define CLA2MUX1_CLAIN11                 CLA_MUX1(11)                       /*!< the input of CLA2MUX1 is CLAIN11(PA8) */
#define CLA3MUX1_CLAIN5                  CLA_MUX1(11)                       /*!< the input of CLA3MUX1 is CLAIN5(PB7) */

#define CLA0MUX1_CLAIN9                  CLA_MUX1(12)                       /*!< the input of CLA0MUX1 is CLAIN9(PB1) */
#define CLA1MUX1_CLAIN14                 CLA_MUX1(12)                       /*!< the input of CLA1MUX1 is CLAIN14(PA11) */
#define CLA2MUX1_CLAIN12                 CLA_MUX1(12)                       /*!< the input of CLA2MUX1 is CLAIN12(PA9) */
#define CLA3MUX1_CLAIN8                  CLA_MUX1(12)                       /*!< the input of CLA3MUX1 is CLAIN8(PB0) */
 
#define CLA0MUX1_CLAIN11                 CLA_MUX1(13)                       /*!< the input of CLA0MUX1 is CLAIN11(PA8) */
#define CLA1MUX1_CLAIN15                 CLA_MUX1(13)                       /*!< the input of CLA1MUX1 is CLAIN15(PA12) */
#define CLA2MUX1_CLAIN13                 CLA_MUX1(13)                       /*!< the input of CLA2MUX1 is CLAIN13(PA10) */
#define CLA3MUX1_CLAIN9                  CLA_MUX1(13)                       /*!< the input of CLA3MUX1 is CLAIN9(PB1) */

#define CLA0MUX1_CLAIN13                 CLA_MUX1(14)                       /*!< the input of CLA0MUX1 is CLAIN13(PA10) */
#define CLA1MUX1_CLAIN17                 CLA_MUX1(14)                       /*!< the input of CLA1MUX1 is CLAIN17(PF1) */
#define CLA2MUX1_CLAIN18                 CLA_MUX1(14)                       /*!< the input of CLA2MUX1 is CLAIN18(PA0) */
#define CLA3MUX1_CLAIN16                 CLA_MUX1(14)                       /*!< the input of CLA3MUX1 is CLAIN16(PF0) */

#define CLA0MUX1_CLAIN15                 CLA_MUX1(15)                       /*!< the input of CLA0MUX1 is CLAIN15(PA12) */
#define CLA1MUX1_CLAIN19                 CLA_MUX1(15)                       /*!< the input of CLA1MUX1 is CLAIN19(PA1) */
#define CLA2MUX1_CLAIN19                 CLA_MUX1(15)                       /*!< the input of CLA2MUX1 is CLAIN19(PA1) */
#define CLA3MUX1_CLAIN17                 CLA_MUX1(15)                       /*!< the input of CLA3MUX1 is CLAIN17(PF1) */

