OKMCU/free-serial-bootloader/bsp/GD32E232x8/Firmware/GD32E232_standard_peripheral/Include/gd32e232_cla.h
/* LUT control */
#define LUTCTL(regval)                   (BITS(0,7) & ((uint32_t)(regval) << 0))

/* CLA output selection */
#define FLIP_FLOP_OUTPUT                 ((uint32_t )0x00000000)            /*!< flip-flop output is selected as CLAx output */
#define LUT_RESULT                       CLA_CTL_OSEL                       /*!< LUT result is selected as CLAx output */

/* flip-flop clock polarity selection */
#define CLA_CLOCKPOLARITY_POSEDGE        ((uint32_t)0x00000000U)            /*!< the clock polarity of flip-flop is posedge */
#define CLA_CLOCKPOLARITY_NEGEDGE        CLA_CTL_CPOL                       /*!< the clock polarity of flip-flop is negedge */

/* flip-flop clock source selection */
#define PRE_CLA_LUT_RESULT               ((uint32_t)0x00000000U)            /*!< the LUT result of the previous CLA units */
#define MUX0_OUTPUT                      ((uint32_t)0x00000001U)            /*!< the multiplexer output of MUX0 */
#define HCLK                             ((uint32_t)0x00000002U)            /*!< HCLK */
#define TIMER_TRGO                       ((uint32_t)0x00000003U)            /*!< TIMER_TRGO */

/* function declarations */
/* CLA initialization and configuration functions */
/* reset CLA */
void cla_deinit(void);
/* enable CLA */
void cla_enable(cla_enum cla_periph);
/* disable CLA */
void cla_disable(cla_enum cla_periph);  
/* get CLA output state */
cla_outputstatus_enum cla_output_state_get(cla_enum cla_periph);
/* configure multiplexer input */
void cla_multiplexer_input_config(cla_enum cla_periph, cla_mux_enum mux, uint32_t input);
/* configure CLA LUT control register value */
void cla_lut_control_config(cla_enum cla_periph, uint8_t lutctl_value);
/* configure CLA output */
void cla_output_config(cla_enum cla_periph, uint32_t output);
/* enable CLA output */
void cla_output_enable(cla_enum cla_periph);
/* disable CLA output */
void cla_output_disable(cla_enum cla_periph);

/* flip-flop configuration */
/* reset CLA flip-flop output */
void cla_flip_flop_output_reset(cla_enum cla_periph);
/* configure clock polarity of flip-flop */
void cla_flip_flop_clockpolarity_config(cla_enum cla_periph, uint32_t polarity);
/* configure clock source of flip-flop */
void cla_flip_flop_clocksource_config(cla_enum cla_periph, uint32_t clock_source);

/* flag and interrupt functions */
/* check CLA flag is set or not */
FlagStatus cla_flag_get(cla_flag_enum flag);
/*clear CLA flag */
void cla_flag_clear(cla_flag_enum flag);
/* enable CLA negedge interrupt */
void cla_negedge_interrupt_enable(uint32_t clanie);
/* disable CLA negedge interrupt */
void cla_negedge_interrupt_disable(uint32_t clanidis);
/* enable CLA posedge interrupt */
void cla_posedge_interrupt_enable(uint32_t clapie);
/* disable CLA posedge interrupt */
void cla_posedge_interrupt_disable(uint32_t clapidis);
/* check CLA interrupt flag is set or not */
FlagStatus cla_interrupt_flag_get(cla_interrupt_flag_enum int_flag);
/* clear CLA interrupt flag */
void cla_interrupt_flag_clear(cla_interrupt_flag_enum int_flag);

#endif /* GD32E232_CLA_H */
